app/channels/application_cable/connection.rb

    def find_verified_user
      # debugger
      verified_user = User.find_by(session_token: request.session.fetch('session_token', nil))
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "xDAzVisr_FnjdJaqa1rP2g"], ["LIMIT", 1]]