app/channels/application_cable/connection.rb

    def find_verified_user
      verified_user = User.find_by(id: cookies.signed[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT $1  [["LIMIT", 1]]