app/controllers/api/channels_controller.rb

    def index
        @channels = Channel.all
---
SELECT  "channels".* FROM "channels" ORDER BY "channels"."id" ASC LIMIT $1  [["LIMIT", 1]]