app/controllers/api/messages_controller.rb

SELECT "messages".* FROM "messages"
---
    def index
        @messages = Message.all.includes(:user)