app/views/api/channels/_channel.json.jbuilder

msgs = []
channel.messages.each do |msg|
---
SELECT "messages".* FROM "messages"