app/channels/chat_channel.rb

  def subscribed
    debugger
    @channel = Channel.find(params[:id])
---
SELECT  "channels".* FROM "channels" WHERE "channels"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def speak(data)
    debugger

    message = @channel.messages.new(body: data['message'])
    message.user_id = current_user.id

    if message.save!
---
INSERT INTO "messages" ("user_id", "body", "messageble_id", "messageble_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["body", "word1"], ["messageble_id", 1], ["messageble_type", "Channel"], ["created_at", "2020-02-18 15:33:23.138687"], ["updated_at", "2020-02-18 15:33:23.138687"]]