app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "xDAzVisr_FnjdJaqa1rP2g"], ["LIMIT", 1]]
---
    def current_user
        #
        return nil unless session[:session_token]
        @current_user ||= User.find_by(session_token: session[:session_token])